# подключаем образ с гредлом и даём ему название build, чтобы можно было использовать в другом образе
FROM gradle:7-jdk11 AS build
# копируем исходный код в директорию /home/gradle/src внутри контейнера
COPY --chown=gradle:gradle . /home/gradle/src
# устанавливаем рабочую директорию
# теперь все консольные команды по умолчанию будут выполняться из директории /home/gradle/src
WORKDIR /home/gradle/src
# RUN - запустить один раз, когда мы собираем образ.
# если образ уже создан, то при запуске контейнера, эта команда НЕ будет выполняться
RUN gradle shadowJar --no-daemon

# подключаем еще один образ, на основе которого мы будем собирать свой собственный образ.
FROM openjdk:11
# Указываем порты.
# До двоеточия - это порт, по которому приложение доступно снаружи контейнера(например: по этому порту можно будет получить доступ, через глобальный интернет)
# После двоеточия - это порт, по которому приложение доступно внутри контейнер (например: чтобы другие запущенные приложения внутри контейнера могли общаться с нашим приложением)
EXPOSE 8080:8080
RUN mkdir /app
COPY --from=build /home/gradle/src/build/libs/*.jar /app/
CMD ["java","-jar","/app/ru.shalkoff.bus_schedule-all.jar"]